Revit 2027 API
BRepBuilder.GetResult Method
 Get the Solid built by this BRepBuilder. This will clear the built geometry stored in the BRepBuilder. This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Solid GetResult()
Public Function GetResult As Solid
public:
Solid^ GetResult()
member GetResult : unit -> Solid
Return Value
Solid
 The Solid built by this BRepBuilder.
Exceptions
Exception | Condition
InvalidOperationException |  This BRepBuilder object hasn't completed building data or was unsuccessful building it. Built Geometry is unavailable. In order to access the built Geometry, Finish() must be called first. That will set the state to completed.
See Also
Reference
BRepBuilder Class
GetResult Overload
Autodesk.Revit.DB Namespace